APEUni PTE 基础词汇
exhaust
intense
deny
nucleus
demand
understand
intellectual
factor
disorder
mean
recycle
circular
appearance
bat
literature
exposure
explore
abstract
conservation
effort
consequently
remain
Budget
reflect
design
competent
force
allow
damp
perception
ingredient
write
combine
industrial
local
lead
solar
scientific
critical
miss
ambitious
distribution
capacity
contest
core
immense
purchase
prosperity
precede
vulnerable
usage
be
medium
opponent
technique
symbol
enable
launch
interest
electric
manufacturer
qualify
readily
sensible
X-ray
ban
determine
species
presentation
include
result
financial
odd
neutral
approach
observe
cope
particularly
rotten
tour
internal
gesture
glimpse
allocate
graduate
adequate
engine
constitute
substantial
accordance
alternative
source
necessarily
responsible
conclusion
ethnic
give
output
pond
positive
ability
potential
oral
hardship
highlight
desperate
association
poverty
division
strategy
management
market
analysis
preparation
beneath
breed
contrary
semester
achievement
radical
scope
convince
measure
weaken
strengthen
union
necessity
independent
wealth
powerful
career
equivalent
generator
motor
humor
optimistic
temper
puzzle
relative
virtually
recently
invariably
hip
elbow
outward
signal
likely
survive
alliance
protection
exchange
flesh
grand
attain
specific
subject
debate
evidence
establish
similar
pregnant
propose
publication
journal
mood
influence
extent
rely
focus
external
promote
negative
recruit
alphabet
spell
despite
performance
requirement
environment
condition
resource
material
limit
supply
faculty
spite
significance
efficiency
represent
single
aspect
debt
truly
average
loan
tuition
insult
criticism
unexpected
enthusiasm
competition
participate
fame
series
paw
project
survey
whereas
interview
administration
option
bake
patient
drink
widespread
acceptance
criminal
regulation
prohibit
vary
definition
legislation
define
substance
loose
product
welfare
unite
aid
comparison
regard
universal
region
obtain
support
writer
characteristic
pulse
billion
variable
graph
select
analyse
click
chief
executive
balance
motivate
diverse
staf
legal
cheerful
enhance
concentration
hence
pad
philosopher
describe
rational
emotional
deliberate
tune
blend
precise
divide
function
creative
logical
tendency
tend
crowd
global
atmosphere
trend
concern
official
greenhouse
personnel
target
attack
datum
agency
Republican
pack
male
candidate
politics
response
reduction
fuel
replace
electrical
efficient
border
urban
span
illegal
cross
crime
prevalent
interfere
apply
import
export
dictate
unlike
kingdom
possession
evolve
interpretation
bear
machinery
commonplace
skilled
employer
bargain
improvement
engage
sexual
racial
fascinate
magnificent
museum
collection
security
object
outside
locate
climate
improve
reveal
reform
rank
pace
overtake
accord
complain
grind
conference
dominate
absent
genuine
claim
structure
impress
margin
apart
challenge
complex
impressive
filter
retain
excess
maintain
flood
erosion
save
collapse
mobile
commerce
device
digital
assistant
application
commercial
location
zone
flash
prove
item
instruction
comprehension
secure
convey
pressure
quote
integrate
argument
character
imaginative
sympathy
entertainment
adapt
classic
benefit
rarely
concept
possibility
definitely
increasingly
emerge
relate
competitive
advantage
furniture
essential
civilize
settle
perceive
overall
significant
inevitable
outcome
Parliament
crown
crucial
ancient
occur
planet
channel
contrast
exploit
technology
gear
physical
molecule
bacteria
virus
activity
culture
affect
belief
network
current
shift
risk
cancer
impact
hunt
somewhat
avoid
trail
whale
adopt
reproduce
communicate
threat
mystery
glorious
Empire
ruin
marine
vital
transportation
cargo
largely
pollution
rub
myth
besides
detail
identify
status
therefore
resemble
indication
owner
estimate
visual
highly
image
accurate
abundance
nearby
density
agriculture
publish
initial
tissue
sticky
clap
snap
pitch
courtesy
burst
nest
maximum
author
curl
flexible
switch
link
formation
earthquake
predict
strike
resident
bang
profit
foster
perspective
threaten
currency
expert
basis
impose
behave
economy
outer
layer
bind
magnetic
magnet
react
oxygen
bubble
tube
interval
timely
weekly
schedule
normally
involve
indoor
discourage
sponsor
vast
original
audience
organisation
implication
democracy
restrict
appliance
explosive
site
correspondent
tackle
topic
stock
lean
recognise
stroke
demonstrate
unique
durable
creature
attempt
origin
trace
scale
remote
journey
disguise
crisis
suffer
confidence
arise
solution
execute
refine
disaster
various
incident
implement
alert
Outlook
campaign
ribbon
feature
colony
tradition
temporary
fund
account
ensure
available
appropriate
conflict
event
explosion
advance
connect
feather
precious
expand
horizon
comedy
drama
hire
salary
senior
domestic
process
intensive
bankrupt
overlook
divorce
invention
household
charge
rate
curiosity
think
deposit
render
expectation
engineer
community
conscious
raw
military
attribute
recommend
presumably
muscle
contract
vehicle
mention
major
universe
find
arrow
aware
scrape
applause
surround
overseas
well-known
theory
selection
survival
individual
inherit
chemical
acid
ore
stream
institution
display
primarily
approve
distinct
category
normal
sailor
generate
marriage
marry
associate
reception
teenager
knot
mission
instead
so-called
professional
rare
nature
spoil
purple
dye
appetite
disease
joint
routine
precaution
absolute
senate
council
respect
retire
loyalty
opportunity
employee
profitable
beneficial
moreover
effective
experimental
strain
resistant
productive
consume
beyond
assembly
exclude
academic
anxiety
primary
acute
injury
perform
intensity
crack
growth
merely
pollute
capture
contribute
harm
consideration
endure
decrease
ratio
sophisticate
scheme
corporate
reward
per
carbon
respond
politician
pretend
action
compare
humanity
dispute
mass
adult
range
stress
cycle
compound
tremendous
satellite
orbit
partner
era
territory
colleague
leader
invade
motion
protein
stimulate
bunch
comparative
laboratory
sequence
gene
constant
symptom
violence
expose
sensitive
fearful
aggressive
manner
remarkable
undoubtedly
considerable
youngster
plus
minus
compose
organ
organism
fundamental
regulate
transport
component
barrier
insect
withstand
sunlight
plentiful
exclusive
convert
digest
gallon
artistic
background
pension
sufficient
sunshine
cast
primitive
elsewhere
alter
childhood
infant
decade
historical
circumstance
famine
consequence
reverse
failure
amateur
injure
mechanism
recovery
compete
adjust
consumer
evaluate
platform
encourage
elderly
stability
amongst
assistance
saddle
nuclear
weapon
volume
liquid
transform
crust
harsh
shed
revenue
invest
multiple
scholarship
athlete
commit
virtual
document
intend
suppose
ignore
triumph
prejudice
entire
unusual
calendar
verify
declaration
trial
resolution
Congress
meantime
sigh
relief
crew
emergency
ease
overnight
approval
favour
extension
trap
comparable
idle
patch
centre
distress
dissolve
identity
immediately
pit
sample
bet
herd
ugly
fragment
foundation
stake
acknowledge
secondary
mental
combat
interact
vision
assignment
elementary
property
maintenance
interior
exterior
leak
oven
landlord
compress
chamber
dense
tract
lung
visible
pursue
consist
figure
invisible
frame
behaviour
collective
enforce
tolerate
elevator
swear
frown
throat
suck
video
boost
bloody
airline
dose
bid
distribute
register
tax
shell
court
arrest
abuse
scandal
board
index
confirm
telescope
investment
theme
depression
suicide
manufacture
modify
suspend
annual
sausage
brand
asset
explode
blast
mount
access
leap
frog
gap
preserve
hydrogen
influential
minister
cabinet
productivity
slight
stuf
proceed
academy
pill
recognition
reality
abroad
wealthy
communication
generally
jean
institute
distinguish
personality
talent
infinite
variation
handle
private
auto
drag
release
revise
wreck
rival
attract
package
plastic
instrument
gradual
interpret
curriculum
establishment
fee
apartment
forbid
ownership
typical
affection
attitude
emphasis
mankind
quest
copyright
comprehensive
electronic
reserve
keyboard
monitor
transmit
creation
software
nowhere
extraordinary
steep
clif
specimen
liver
voluntary
reject
obvious
majority
rural
cable
jet
exception
adventure
isolate
interrupt
precision
variety
extensive
semiconductor
encounter
argue
ignorance
practically
submerge
amaze
bay
existence
investigate
transparent
shield
complicate
landscape
authority
uncover
instance
grab
tray
counter
misunderstand
Romantic
pattern
undergraduate
entry
award
finance
responsibility
theoretical
undertake
mathematics
spot
prominent
nerve
female
create
desirable
preference
tone
social
similarly
provision
payment
erect
boundary
conversely
proportion
accomplish
nursery
abandon
pilot
evolution
massive
enormous
bulk
admission
applicant
hazard
organic
capable
artificial
distinction
label
terminal
commitment
inform
screen
directly
persist
arrange
ceremony
whichever
decline
eagle
respectively
dramatic
assist
feasible
inner
portion
devote
disappear
seminar
slogan
expression
solve
disgust
tutor
painter
afford
unless
extra
lane
leisure
appeal
outline
conform
consumption
alarm
accommodation
postpone
excessive
exhibit
gallery
studio
peer
architecture
fatigue
accident
shortage
acquire
govern
fortunately
auction
session
emotion
notify
anyway
section
depart
via
dispose
basically
vote
election
unfortunately
active
construct
mislead
optional
brief
infect
previous
automatic
phase
translation
volcano
glow
melt
campus
creep
inland
conventional
cite
junior
quit
motive
prosperous
guidance
facility
invasion
chapter
summary
leather
profound
discount
delegate
essay
accuracy
client
objective
instinct
reaction
festival
snack
reference
prior
reliable
shortly
detection
crystal
identification
religious
convenience
behalf
submit
clash
leadership
representative
interaction
format
mechanical
jury
log
corridor
crash
physician
committee
scare
concise
residence
preliminary
calculate
critic
biology
tough
appointment
quotation
contact
assumption
corporation
provide
formal
sector
credit
fulfil
fertile
version
flaw
proposal
volunteer
thorough
cancel
imagination
vocabulary
viewpoint
fiction
slide
intelligence
stain
vacation
evident
speculate
numerous
folk
percentage
additional
discipline
prospective
dynamic
vessel
deadline
cash
occurrence
transmission
indicate
tension
hardware
receipt
phenomenon
imitate
accent
relativity
editor
poetry
convention
rhythm
guideline
grasp
enquire
noticeable
comment
flourish
objection
controversy
principal
regardless
framework
hesitate
electricity
giant
relevant
up-to-date
mathematical
organise
principle
particle
sphere
equation
namely
electron
frequent
thick
fog
severe
lorry
philosophy
derive
equality
justify
conduct
employment
oppose
intelligent
remind
trash
destructive
assign
petrol
ambulance
delivery
renew
imperative
destruction
desire
frank
architect
balcony
curve
dimension
Forth
combination
specify
string
coordinate
penetrate
gravity
ankle
radiation
decay
prime
restore
input
ideal
diagram
fancy
prospect
minority
presence
continual
fountain
invent
typewriter
journalist
recorder
tide
oblige
obligation
initiative
residential
psychological
extreme
camel
conquer
attraction
geometry
keen
specialist
riot
suspect
absorb
worthwhile
insight
valid
fabric
element
horn
resolve
lord
Passion
sustain
scout
fairly
slice
vitamin
naked
appreciate
recommendation
abundant
supplement
mushroom
treatment
alcohol
faulty
induce
agent
poll
elect
eliminate
democratic
textile
commission
exceed
classification
cognitive
underneath
scholar
reconcile
nevertheless
prestige
stadium
salesman
coach
brilliant
entertain
amuse
moral
admire
fairy
somehow
butterfly
worm
physicist
resistance
independence
loyal
ambassador
tropical
Pole
assume
descend
extend
rat
constitution
civil
emperor
protest
steady
grain
stale
province
complaint
rail
inhabitant
liberal
differ
shortcoming
error
shelter
tag
monument
humble
subway
embrace
grant
inspire
educate
concrete
strategic
urgent
brow
literary
reporter
curious
mixture
feedback
enrich
musician
historic
heritage
saint
incredible
retreat
occupy
drill
urge
specifically
summit
harness
realm
illustration
christian
spin
rocket
concentrate
turbine
pump
angle
blade
flat
owe
sheer
horror
grateful
route
circuit
interference
rescue
multiply
breadth
hurricane
tragedy
carrier
victim
plot
vertical
recession
literacy
correspond
chip
Calorie
bucket
spark
lid
stir
fluid
drum
lick
stable
anxious
relax
technician
attach
float
swell
squeeze
detect
muscular
ballet
vocal
hammer
confront
conductor
imply
remark
tractor
religion
definite
receiver
passive
introduction
auxiliary
mere
sum
deficiency
superficial
utter
clerk
troop
standpoint
wool
vanish
lucky
addition
peak
panel
reasonable
bump
pour
scatter
mild
moisture
slope
column
diameter
faith
notion
pursuit
thereby
peculiar
accompany
wrap
expansion
cautious
acquisition
donation
rotate
storage
delicate
swift
recover
outstanding
repeatedly
canal
confuse
grip
favourite
expense
thumb
awful
charity
conclude
graceful
tender
salad
ridge
relieve
static
lover
frequency
superior
prevail
recreation
dorm
ash
bathe
estate
stripe
poisonous
poison
barn
beam
straw
bundle
clay
tile
craft
microphone
transition
procedure
suggestion
pest
centigrade
construction
sketch
statement
hay
Revolutionary
chew
thirsty
title
overcome
aside
priority
classical
rigid
contemporary
scenery
conceal
enthusiastic
fierce
daylight
fur
helpful
observer
minor
measurement
formula
ancestor
upright
butch
spill
flame
ghost
innocent
fuss
evil
fantastic
census
exact
roller
crush
versus
resist
temptation
witness
undergo
plantation
bean
cease
frustrate
avenue
suburb
dismiss
workshop
carriage
cart
barely
revolt
instruct
drain
delete
fraction
reluctant
unemployment
illustrate
arrangement
privilege
disastrous
champion
heroic
dash
contribution
faint
curse
stare
pose
trunk
polish
continuous
golf
width
reputation
Marxist
chest
eyesight
successive
minimum
upper
episode
gulf
refugee
immigrant
furthermore
surplus
wisdom
intention
permission
audio
assemble
dock
thrust
dirt
candy
carrot
rid
gross
classify
weed
chart
thrive
calm
heal
sorrow
bold
expedition
reckon
clarify
globe
undo
yield
nitrogen
recall
exceedingly
naturally
bloom
royal
devise
laser
unify
Unity
mud
helicopter
shallow
powder
consultant
genius
consult
transfer
Christ
resume
prescription
depress
split
ultimate
comprise
loop
accordingly
accelerate
circulate
collision
tunnel
atomic
strip
random
honey
halt
spider
mate
excursion
pea
elastic
exaggerate
grammar
handwrite
observation
coil
logic
decent
accumulate
whip
dessert
vacuum
locality
fold
limb
coarse
governor
underground
instal
attorney
wrist
occupation
annoy
forecast
cattle
triangle
accountant
laundry
automobile
airplane
airport
surgery
microscope
departure
passport
compass
deaf
gum
editorial
hen
thermometer
mineral
horizontal
prescribe
glove
certificate
vivid
mainland
cupboard
headline
tense
guitar
altitude
cabbage
menu
dusk
violin
sunrise
subjective
chemist
widow
paragraph
tolerant
carpenter
portrait
arithmetic
drawer
medal
dormitory
world-wide
soar
companion
spectacular
shrink
moderate
mature
parallel
breakthrough
inflation
dialect
dominant
dam
swallow
ally
qualification
notwithstanding
lamb
likelihood
fashion
burden
consistent
lens
allowance
costly
sacrifice
physiological
tolerance
lag
murder
arrival
insure
offence
meanwhile
lobby
widen
trumpet
virtue
inferior
bride
occasion
compensate
wardrobe
aluminium
chin
conquest
utilise
hell
stretch
scratch
spray
bond
fashionable
latter
settlement
convict
alongside
conviction
conservative
confine
boast
superb
temple
statue
boom
antique
destination
warfare
violate
sanction
rear
absence
endless
enquiry
appoint
lodge
vice
restrain
likewise
solitary
attractive
plunge
briefcase
smash
spacecraft
chaos
hut
continuity
rage
loosen
instrumental
battery
plug
profile
scrutiny
dependant
judgement
offensive
olive
emphasise
fertiliser
band
hedge
remedy
clue
beard
deck
subsequent
wax
protective
sunset
frost
telecommunication
realistic
dot
scan
identical
compel
advocate
segment
harmony
brick
occasional
liquor
yearly
grape
container
imaginary
aircraft
elaborate
script
civilisation
rob
starve
discard
disposal
preferable
clause
jar
illusion
stem
impression
imitation
confusion
cue
soda
dumb
sole
palm
drift
infer
premature
permanent
worship
luxury
echo
excitement
laughter
refresh
dull
conjunction
seal
astonish
manual
spur
gym
confident
mutual
acquaintance
agenda
purse
dip
timber
crude
insurance
pepper
deceive
vibrate
thunder
mask
flee
cultivate
railway
nationality
costume
procession
progressive
reflection
cushion
mill
lawn
gardener
slippery
substitute
provoke
command
aisle
headquarter
weave
replacement
sake
diplomatic
silicon
fate
trim
sin
wallet
bleed
prompt
specialise
merchant
anticipate
succession
casual
compromise
concession
accommodate
enlarge
signature
neighbourhood
parade
deserve
holy
acre
poet
strap
profession
fleet
operator
nurture
repertoire
disturb
upset
utmost
roar
sword
mercy
paste
beast
alike
controversial
justice
accuse
subordinate
ambition
contradiction
heighten
vapor
economical
spiritual
soak
apparent
thereafter
Grace
ridiculous
moist
twist
duration
probable
accidental
inspect
offend
obey
vigorous
limitation
neglect
mechanic
evidently
dental
flock
aboard
condense
mysterious
negotiate
modest
arouse
generous
defeat
satisfactory
fisherman
surrender
envy
admit
forge
sightsee
centimetre
jungle
mat
fibre
chop
rope
cord
anchor
head
house
learn
lounge
aerial
simplify
toast
catalogue
quiz
omit
repetition
warmth
purity
librarian
equip
calculator
worthy
orchestra
senator
utility
crawl
exert
delicious
intimate
proof
therapy
insert
injection
confess
deadly
suspicion
breast
wander
loaf
coverage
hostile
heel
handful
bounce
tame
bare
jewel
uneasy
edition
policy
ignorant
guilty
helpless
harden
whilst
choke
partial
baffle
waterproof
baseball
score
towel
whoever
emit
wholly
miserable
jealous
forehead
Honourable
exclaim
gaze
bureau
dump
ministry
wolf
torture
eve
slip
priest
rally
mess
hopeful
chase
assure
endurance
panic
transient
magic
bullet
petroleum
seemingly
barrel
discharge
bolt
earnest
dragon
recite
detective
whisper
irrigation
ditch
anniversary
afterward
greedy
garbage
wicked
railroad
bachelor
slap
pedestrian
terror
county
highway
swing
nuisance
instant
cruise
backward
rebel
slam
Revelation
lightning
breeze
umbrella
chill
kindness
fare
torch
van
pillar
embarrass
monetary
nonsense
hobby
intermediate
outlet
indirect
painful
elegant
solemn
sideways
hollow
millimetre
glue
drip
Bible
systematic
beforehand
sew
pigeon
navigation
frontier
lump
thoughtful
obstacle
membership
morality
layout
criticise
vain
toll
spokesman
glance
Venture
treaty
stack
monopoly
pledge
incline
rap
favourable
kindergarten
steer
jazz
cartoon
mould
sway
harbour
brutal
fruitful
invitation
Gymnasium
copper
cheat
onion
cement
overhead
boot
accustom
sauce
inn
operational
fluent
dim
voltage
hum
dairy
mosquito
lap
comb
stif
whistle
fake
bacon
fry
bulb
vinegar
pierce
scream
lemon
punch
sour
sack
jaw
claw
slim
congratulation
fatal
opera
germ
scarce
beloved
hint
preach
oval
rod
fade
ripe
horrible
reunion
entitle
plague
cop
cling
insist
glory
conscience
brake
casualty
amidst
mist
pine
portable
approximate
cabin
stave
furnace
radar
blanket
defect
aviation
beggar
memorial
rumor
axe
mayor
vacant
referee
decisive
smuggle
lad
arbitrary
navy
sleeve
spit
await
grave
scarcely
consequent
despair
refrigerator
grim
patience
balloon
lease
gang
ashamed
blank
nightmare
decorate
skim
furnish
pray
summarise
subtract
supreme
slender
tedious
pessimistic
deputy
reservation
pat
applicable
awkward
shiver
veteran
energetic
naval
removal
kettle
shave
sting
cassette
singular
simplicity
apologize
hook
rib
Negro
eternal
workman
rust
kneel
chap
licence
consent
penalty
cigar
reenforce
indifferent
reflexion
Porter
heave
profess
cooperate
connexion
garlic
carpet
determination
spade
mug
liberty
pillow
funeral
devil
optical
whatsoever
downwards
yawn
concede
resort
scissor
barber
pant
counsel
withdraw
handy
packet
cube
apology
indispensable
poem
indicative
console
hatred
pinch
preface
memorize
merit
token
handbag
marvellous
splendid
troublesome
cumulative
permissible
rack
unload
stern
inward
impatient
fasten
flour
shrug
appraisal
synthetic
charm
stationary
vague
screw
cashier
inclose
waggon
selfish
liberate
rainbow
sue
rude
plural
baggage
outset
sympathetic
crane
waken
raid
brave
footstep
civilian
roast
heap
orderly
violet
metric
diligent
parcel
advisable
fireman
correspondence
revolve
weep
miracle
goodness
presently
merry
respective
condemn
considerate
charter
divine
sow
ache
proportional
characterise
fortnight
kid
prayer
require
dive
open
follow
system
hear
economic
assess
issue
bound
happen
federal
resign
possess
liable
relationship
former
bore
end
embassy
queue
restless
defiance
statistic
setting
fitting
rent
lower
advertize
advertizement
anyhow
applaud
barque
brass
broom
cigaret
commander
congratulate
co-operative
courtyard
curtain
dictation
donkey
doubtful
draught
faithful
farewell
finally
freight
gaol
gramme
gratitude
grocer
guaranty
guy
haste
heir
hopeless
horsepower
industrialise
instilment
lavatory
L
litre
livingroom
luggage
maid
missile
niece
notebook
paperback
pint
postage
preposition
pronoun
publicity
punctual
rag
restraint
revenge
rifle
rouse
rug
saucer
scold
sincere
skilful
socialism
socialist
sore
steamer
stereo
stoop
tidy
tremble
typist
tyre
underline
volt
waist
weld
banner
clumsy
phantasy
gasolene
humorous
inference
nephew
nylon
optimum
ounce
refusal
relay
sympathise
wit
damn
worthless